{
    "developer-tag": "Desarrollador Web Full Stack",
    "tech-stack": "Stack de tecnologías",
    "contact-email": "Contáctame a través de",
    "at": "en",
    "languages": "Idiomas",
    "projects": "Proyectos",
    "about-me": "Sobre mí",
    "experience": "Experiencia",
    "about-me-message": "<h5>Hola,</h5><br><p>Soy Oscar Ranuare, un apasionado desarrollador web full stack con un talento para convertir ideas en realidad digital. <b>Con más de cinco años de experiencia autodidacta en programación</b>, me he sumergido en el mundo del desarrollo web, perfeccionando mis habilidades en diversas tecnologías y frameworks.</p><br><p>Desde la creación de soluciones backend impecables con Python y Django hasta la arquitectura de APIs ultrarrápidas utilizando FastAPI, suelo desafiarme en de <b>construir sistemas robustos y escalables</b> que brinden experiencias de usuario excepcionales. En el frontend, empleo el poder de JavaScript y TypeScript en aplicaciones web, aprovechando frameworks como Vue.js para crear <b>interfaces dinámicas que cautivan a los usuarios</b>.</p><br><p>Pero no se trata solo del código para mí; también soy <b>apasionado por la estética y el diseño de la interfaz de usuario</b>, adoptando principios de diseño moderno con herramientas como Tailwind CSS para crear diseños elegantes y responsive.</p><br><p>En cuanto al control de versiones y la colaboración, no soy ajeno a Git y GitHub, integrándome perfectamente en flujos de trabajo de desarrollo para optimizar procesos y facilitar el trabajo en equipo. Y no olvidemos las bases de datos: cuento con experiencia en PostgreSQL y MongoDB, asegurando que los datos se gestionen de manera eficiente y segura en todos los proyectos.</p><br><p>Ya sea implementando aplicaciones en Heroku, aprovechando el poder de los servicios en la nube como Google Cloud, AWS, DigitalOcean y más, o ya sea navegando por el mundo de Linux, estoy <b>siempre a la espera por explorar nuevas tecnologías y empujar los límites</b> de lo que es posible en el desarrollo web.</p><br><p>Colaboremos y demos vida a su visión: ¡escríbame y hagamos magia!</p>",
    "projects-list":{
        "kbod":{
            "title": "Kbod",
            "description": "Kbod es una plataforma de venta al por mayor dedicada a vender productos a socios comerciales. Está compuesta por una plataforma para clientes, donde pueden ver los productos, precios y stock. La plataforma también cuenta con un panel de administración completamente personalizado para el equipo."
        },
        "capturecgi":{
            "title": "CaptureCGI",
            "description": "Portafolio de CaptureCGI, ofrecen un servicio de imágenes de alta calidad, animaciones, recorridos y tours de realidad virtual 360 para arquitectura y bienes raíces."
        },
        "wiigo-us": {
            "title": "Agenda Wiigo",
            "description": "Es una aplicación web que permite a los clientes de Wiigo US agendar videollamadas con el equipo. Puedes seleccionar una fecha, hora y el representante que te atenderá. Envía recordatorios por correo, y gestiona la disponibilidad de los representantes."
        },
        "clients-scrapper":{
            "title": "Busca-clientes",
            "description": "Con la ayuda de la API de Google Maps esta aplicación busca clientes potenciales en un área especifica y palabras claves indicadas. Dibuja un área en el mapa y luego busca los clientes, busca los correos, teléfonos de contacto y exporta la información en un archivo CSV de Excel."
        },
        "winseller":{
            "title": "Winseller",
            "description": "Busca datos de diferentes sitios web e-commerce y obtiene información útil que almacena. De esta manera, los precios, stocks siempre se actualizan automaticamente de la información de los proveedores."
        },
        "boostshop":{
            "title": "Boostshop",
            "description": "Una plataforma SaaS para los negocios que manejan inventario, ordenes, clientes y productos. Este fue mi primer proyecto como desarrollador full stack."
        },
        "tasks":{
            "title": "App de Tareas",
            "description": "Una aplicación de gestión de tareas que permite a los equipos gestionar sus tareas y seguir el progreso de cada una. Facilita el trabajo del equipo y les permite ser más productivos."
        }
    },
    "experiences":{
        "Kbod":{
            "position": "Desarrollador Web",
            "date": "Octubre 2021 a la fecha",
            "time": "Tiempo completo",
            "description": "Responsable de desarrollar y mantener aplicaciones web para la empresa. He trabajado en diferentes proyectos, desde scraping de datos, sitios e-commerce, hasta la construcción de herramientas internas para el equipo. También he sido responsable del deployment y el mantenimiento de los servidores."
        },
        "Boostshop": {
            "position": "Fundador y Desarrollador Líder",
            "date": "Septiembre 2021 a la fecha",
            "time": "Medio tiempo",
            "description": "Un proyecto personal en el que he estado trabajando durante los últimos años. Comenzó como un proceso de aprendizaje y se convirtió en un producto real que es utilizado por clientes. He sido responsable de todo el proceso de desarrollo, desde el diseño hasta la implementación. Actualmente trabajo a tiempo parcial en este proyecto para mantenerlo actualizado."
        }
    }
}